---
permalink: encryption-at-rest/encrypt-existing-volume-task.html 
sidebar: sidebar 
keywords: enabling, encryption, existing, volume, volume move start, command, volume encryption conversion start 
summary: È possibile utilizzare uno dei due metodi per attivare la crittografia su un volume esistente, utilizzando il comando di avvio dello spostamento del volume o il comando di avvio della conversione della crittografia del volume. 
---
= Attivare la crittografia su un volume esistente
:allow-uri-read: 


[role="lead"]
È possibile utilizzare uno dei due metodi disponibili per abilitare la crittografia su un volume &mdash;utilizzando `volume move start command` o utilizzando il `volume encryption conversion start` comando.

.A proposito di questa attività
* A partire da ONTAP 9.3, è possibile utilizzare `volume encryption conversion start` comando per abilitare la crittografia di un volume esistente "sul posto", senza dover spostare il volume in una posizione diversa. In alternativa, è possibile utilizzare `volume move start` comando.
* Per ONTAP 9,2 e versioni precedenti, è possibile utilizzare solo `volume move start` per attivare la crittografia spostando un volume esistente.




== Attivare la crittografia su un volume esistente con il comando di avvio della conversione della crittografia del volume

A partire da ONTAP 9.3, è possibile utilizzare `volume encryption conversion start` comando per abilitare la crittografia di un volume esistente "sul posto", senza dover spostare il volume in una posizione diversa.

Dopo aver avviato un'operazione di conversione, è necessario completarla. Se si verificano problemi di prestazioni durante l'operazione, è possibile eseguire `volume encryption conversion pause` per sospendere l'operazione e il `volume encryption conversion resume` per riprendere l'operazione.

[NOTE]
====
Non è possibile utilizzare `volume encryption conversion start` Per convertire un volume SnapLock.

====
.Fasi
. Abilitare la crittografia su un volume esistente:
+
`volume encryption conversion start -vserver SVM_name -volume volume_name`

+
Per l'intera sintassi dei comandi, vedere la pagina man relativa al comando.

+
Il seguente comando consente la crittografia sul volume esistente `vol1`:

+
[listing]
----
cluster1::> volume encryption conversion start -vserver vs1 -volume vol1
----
+
Il sistema crea una chiave di crittografia per il volume. I dati del volume vengono crittografati.

. Verificare lo stato dell'operazione di conversione:
+
`volume encryption conversion show`

+
Per l'intera sintassi dei comandi, vedere la pagina man relativa al comando.

+
Il seguente comando visualizza lo stato dell'operazione di conversione:

+
[listing]
----
cluster1::> volume encryption conversion show

Vserver   Volume   Start Time           Status
-------   ------   ------------------   ---------------------------
vs1       vol1     9/18/2017 17:51:41   Phase 2 of 2 is in progress.
----
. Una volta completata l'operazione di conversione, verificare che il volume sia abilitato per la crittografia:
+
`volume show -is-encrypted true`

+
Per l'intera sintassi dei comandi, vedere la pagina man relativa al comando.

+
Il seguente comando visualizza i volumi crittografati su `cluster1`:

+
[listing]
----
cluster1::> volume show -is-encrypted true

Vserver  Volume  Aggregate  State  Type  Size  Available  Used
-------  ------  ---------  -----  ----  -----  --------- ----
vs1      vol1    aggr2     online    RW  200GB    160.0GB  20%
----


.Risultato
Se si utilizza un server KMIP per memorizzare le chiavi di crittografia di un nodo, ONTAP "`invia automaticamente`" una chiave di crittografia al server quando si crittografa un volume.



== Attivare la crittografia su un volume esistente con il comando di avvio spostamento volume

È possibile utilizzare `volume move start` per attivare la crittografia spostando un volume esistente. È necessario utilizzare `volume move start` In ONTAP 9.2 e versioni precedenti. È possibile utilizzare lo stesso aggregato o un aggregato diverso.

.Di cosa hai bisogno
Per eseguire questa attività, è necessario essere un amministratore del cluster o un amministratore SVM al quale l'amministratore del cluster ha delegato l'autorità.

link:delegate-volume-encryption-svm-administrator-task.html["Delega dell'autorizzazione all'esecuzione del comando di spostamento del volume"]

.A proposito di questa attività
* A partire da ONTAP 9.8, è possibile utilizzare `volume move start` Per attivare la crittografia su un volume SnapLock o FlexGroup.
* A partire da ONTAP 9.6, è possibile utilizzare la crittografia a livello di aggregato per assegnare le chiavi all'aggregato contenente per i volumi da spostare. Un volume crittografato con una chiave univoca viene chiamato _volume NVE_. Un volume crittografato con una chiave a livello di aggregato viene chiamato _volume NAE_ (per NetApp aggregate Encryption). I volumi non in testo normale non sono supportati negli aggregati NAE.
* A partire da ONTAP 9.4, se si attiva "`cc-mode`" quando si imposta il Gestore chiavi integrato, i volumi creati con `volume move start` i comandi vengono crittografati automaticamente. Non è necessario specificare `-encrypt-destination true`.


.Fasi
. Spostare un volume esistente e specificare se la crittografia è attivata sul volume:
+
[cols="35,65"]
|===


| Per convertire... | Utilizzare questo comando... 


 a| 
Un volume non crittografato su un volume NVE
 a| 
`volume move start -vserver SVM_name -volume volume_name -destination-aggregate aggregate_name -encrypt-destination true`



 a| 
Un volume NVE o plaintext su un volume NAE (supponendo che la crittografia a livello di aggregato sia attivata sulla destinazione)
 a| 
`volume move start -vserver SVM_name -volume volume_name -destination-aggregate aggregate_name -encrypt-with-aggr-key true`



 a| 
Un volume NAE su un volume NVE
 a| 
`volume move start -vserver SVM_name -volume volume_name -destination-aggregate aggregate_name -encrypt-with-aggr-key false`



 a| 
Un volume NAE su un volume non crittografato
 a| 
`volume move start -vserver SVM_name -volume volume_name -destination-aggregate aggregate_name -encrypt-destination false -encrypt-with-aggr-key false`



 a| 
Un volume NVE su un volume non crittografato
 a| 
`volume move start -vserver SVM_name -volume volume_name -destination-aggregate aggregate_name -encrypt-destination false`

|===
+
Per l'intera sintassi dei comandi, vedere la pagina man relativa al comando.

+
Il seguente comando converte un volume non crittografato denominato `vol1` Su un volume NVE:

+
[listing]
----
cluster1::> volume move start -vserver vs1 -volume vol1 -destination-aggregate aggr2 -encrypt-destination true
----
+
Supponendo che la crittografia a livello di aggregato sia attivata sulla destinazione, il seguente comando converte un volume NVE o non crittografato denominato `vol1` Su un volume NAE:

+
[listing]
----
cluster1::> volume move start -vserver vs1 -volume vol1 -destination-aggregate aggr2 -encrypt-with-aggr-key true
----
+
Il seguente comando converte un volume NAE denominato `vol2` Su un volume NVE:

+
[listing]
----
cluster1::> volume move start -vserver vs1 -volume vol2 -destination-aggregate aggr2 -encrypt-with-aggr-key false
----
+
Il seguente comando converte un volume NAE denominato `vol2` su un volume non crittografato:

+
[listing]
----
cluster1::> volume move start -vserver vs1 -volume vol2 -destination-aggregate aggr2 -encrypt-destination false -encrypt-with-aggr-key false
----
+
Il seguente comando converte un volume NVE denominato `vol2` su un volume non crittografato:

+
[listing]
----
cluster1::> volume move start -vserver vs1 -volume vol2 -destination-aggregate aggr2 -encrypt-destination false
----
. Visualizzare il tipo di crittografia dei volumi del cluster:
+
`volume show -fields encryption-type none|volume|aggregate`

+
Il `encryption-type` Field è disponibile in ONTAP 9.6 e versioni successive.

+
Per l'intera sintassi dei comandi, vedere la pagina man relativa al comando.

+
Il seguente comando visualizza il tipo di crittografia dei volumi in `cluster2`:

+
[listing]
----
cluster2::> volume show -fields encryption-type

vserver  volume  encryption-type
-------  ------  ---------------
vs1      vol1    none
vs2      vol2    volume
vs3      vol3    aggregate
----
. Verificare che i volumi siano abilitati per la crittografia:
+
`volume show -is-encrypted true`

+
Per l'intera sintassi dei comandi, vedere la pagina man relativa al comando.

+
Il seguente comando visualizza i volumi crittografati su `cluster2`:

+
[listing]
----
cluster2::> volume show -is-encrypted true

Vserver  Volume  Aggregate  State  Type  Size  Available  Used
-------  ------  ---------  -----  ----  -----  --------- ----
vs1      vol1    aggr2     online    RW  200GB    160.0GB  20%
----


.Risultato
Se si utilizza un server KMIP per memorizzare le chiavi di crittografia di un nodo, ONTAP "`invia automaticamente`" una chiave di crittografia al server quando si crittografa un volume.
