---
permalink: flexgroup/shrink-flexgroup-volume-task.html 
sidebar: sidebar 
keywords: reduce, size, flexgroup, volume, flex group, resize, shrink, shrinking, autosize 
summary: A partire da ONTAP 9.6, è possibile ridimensionare un volume FlexGroup a un valore inferiore alle dimensioni correnti per liberare spazio inutilizzato dal volume. Quando si riducono le dimensioni di un volume FlexGroup, ONTAP ridimensiona automaticamente tutti i componenti FlexGroup. 
---
= Ridurre le dimensioni di un volume ONTAP FlexGroup
:allow-uri-read: 
:icons: font
:imagesdir: ../media/


[role="lead"]
A partire da ONTAP 9.6, è possibile ridimensionare un volume FlexGroup a un valore inferiore alle dimensioni correnti per liberare spazio inutilizzato dal volume. Quando si riducono le dimensioni di un volume FlexGroup, ONTAP ridimensiona automaticamente tutti i componenti FlexGroup.

.Fase
. Controllare le dimensioni correnti del volume FlexGroup: 'Volume size -vserver _vserver_name_ -volume _fg_name_'
. Ridurre le dimensioni del volume FlexGroup: `volume size -vserver _vserver_name_ -volume _fg_name_ _new_size_`
+
Quando si specifica la nuova dimensione, è possibile specificare un valore inferiore alla dimensione corrente o un valore negativo utilizzando il segno meno (-) per ridurre la dimensione corrente del volume FlexGroup.

+
[NOTE]
====
Se la riduzione automatica è attivata per il volume (`volume autosize` ), la dimensione automatica minima viene impostata sulla nuova dimensione del volume.

====
+
Nell'esempio seguente vengono visualizzate le dimensioni correnti del volume FlexGroup denominato Volx e il volume viene ridimensionato a 10 TB:

+
[listing]
----
cluster1::> volume size -vserver svm1 -volume volX
(volume size)
vol size: FlexGroup volume 'svm1:volX' has size 15TB.

cluster1::> volume size -vserver svm1 -volume volX 10TB
(volume size)
vol size: FlexGroup volume 'svm1:volX' size set to 10TB.
----
+
Nell'esempio seguente vengono visualizzate le dimensioni correnti del volume FlexGroup denominato Volx e le dimensioni del volume vengono ridotte di 5 TB:

+
[listing]
----
cluster1::> volume size -vserver svm1 -volume volX
(volume size)
vol size: FlexGroup volume 'svm1:volX' has size 15TB.

cluster1::> volume size -vserver svm1 -volume volX -5TB
(volume size)
vol size: FlexGroup volume 'svm1:volX' size set to 10TB.
----

